#pragma once

/// TextFarm
/// 
/// 시간 : GetTickCount64() 사용 OR 행동시 시간 추가(직접 시간(Class)을 만듬)
/// 
/// 1. 농장 : 감자, 고구마, 당근 -> 각각 열매 하나로 여러개(랜덤) 재배
/// 
/// 2. 과수원 : 사과, 오렌지 -> 씨앗이 나무로 성장 -> 무한재배
/// 
/// 3. 목장 : 돼지, 소, 말 -> 새끼성장 -> 교배
/// 
/// 4. 상점 : 판매(수확한것들), 구매(열매, 씨앗, 새끼, 확장, 성장촉진제(물, 비료, 먹이) -> 로 성장 or 교배가능 시키기 -> 쓸경우 한 시간 지남)
/// 
/// 5. 집 : 잠자기, To Be Continue...
/// 
/// 6. 배고픔 : 일단 전부 생으로 먹을수 있게 -> 추후에 농작물과 고기는 구워 먹도록
/// 
/// 7. 시간보내기 : 1시간 지나도록
/// 
/// 8. 설명
/// 
/// 9. 종료
/// 
/// 
/// 안한것
/// Crops의 성장하기 안함
/// 
/// 
/// 
///